<!-- html部分 -->
<template>
	<div id="app">
		<h1>Welcome</h1>
		
		<ve-line :data="chartData"></ve-line>
		</router-view>
	</div>
</template>
<!-- js部分-->
<script>
	export default {
		name: '',
		data() {
			return {
				chartData: {
          columns: ['日期', '周口港', '漯河港', '上海港','日照港'],
          rows: [
            { '日期': '1/1', '周口港': 1393, '漯河港': 1093, '上海港': 0.32, '日照港': 1093},
            { '日期': '1/2', '周口港': 3530, '漯河港': 3230, '上海港': 0.26 ,'日照港': 1093},
            { '日期': '1/3', '周口港': 2923, '漯河港': 2623, '上海港': 0.76 ,'日照港': 1093},
            { '日期': '1/4', '周口港': 1723, '漯河港': 1423, '上海港': 0.49 ,'日照港': 1093},
            { '日期': '1/5', '周口港': 3792, '漯河港': 3492, '上海港': 0.323 ,'日照港': 1093},
            { '日期': '1/6', '周口港': 4593, '漯河港': 4293, '上海港': 0.78 ,'日照港': 1093}
          ]
        }

			};
		},
		methods: {
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
